IDEA StatiCa Open Model
Point2D.X Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the X-coordinate value
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double X { get; set; }
Public Property X As Double
	Get
	Set
public:
property double X {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
Point2D Class
IdeaRS.OpenModel.Geometry2D Namespace